[
  {
    "id": "mr",
    "title": "Cadence Chat Export UI",
    "description": "UX Design | Vue | Frontend Development",
    "details": "This feature was designed to allow users of Cadence, a chat management tool to setup both manual and automated exports of chat leads and activity reports. The UI was built in Vue and connected to an API to toggle nightly automated exports on and off. In addition, a manaul export feature allowed the user to request an export which was emailed to them immediately.",
    "img1": "http://chuckleone.com/static/media/mr/Cadence-Chat-Export.png",
    "img2": "http://chuckleone.com/static/media/mr/Cadence-Chat-Export-modal1.png",
    "img3": "http://chuckleone.com/static/media/mr/Cadence-Chat-Export-modal2.png",
    "imgAlt": "screenshot of Cadence exports page"
  },
  {
    "id": "hps",
    "title": "Harris Print Solutions Web Site",
    "description": "UX Design | Web Site Development",
    "details": "Harris Print Solutions, a division of Harris Computer needed a completely new design for their web site. I was tasked with designing and developing an entirely new web site with new layouts, forms and embedded multimedia files.",
    "img1": "http://chuckleone.com/static/media/hps/harrisprintsolutions.png",
    "img2": "http://chuckleone.com/static/media/hps/harrisprintsolutions-print.png",
    "img3": "http://chuckleone.com/static/media/hps/harrisprintsolutions-forms.png",
    "imgAlt": "screenshot of Harris Print Solutions page"
  },
  {
    "id": "gathr",
    "title": "Mobile App Design",
    "description": "Logo/brand identity | UX Design | Mobile app design",
    "details": "gathR was a mobile app concept that revolved around social connections. The product owner need a logo/brand identity and mobile app designs. I started with developing mood boards and concepts, finally delivering design guides to aid the mobile app developer.",
    "img1": "http://chuckleone.com/static/media/gathr/gathr-destiny.png",
    "img2": "http://chuckleone.com/static/media/gathr/design-guide-analog.png",
    "img3": "http://chuckleone.com/static/media/gathr/gathr-new-dawn.png",
    "imgAlt": "screenshot of gathR mobile app"
  },
  {
    "id": "msh",
    "title": "Logo/brand identity and progressive app prototype",
    "description": "Logo Design | Mood Board | Interactive Prototype",
    "details": "Mood board, logo design and interactive prototype written in Ionic Framework/Angular JS",
    "img1": "http://chuckleone.com/static/media/gathr/gathr-destiny.png",
    "img2": "http://chuckleone.com/static/media/gathr/design-guide-analog.png",
    "img3": "http://chuckleone.com/static/media/gathr/gathr-new-dawn.png",
    "imgAlt": "screenshot of MSH mobile app"
  },
  {
    "id": "mgh",
    "title": "Progressive Web Application",
    "description": "UX Design | Wireframe | Prototype | CSS | HTML | JavaScript | Angular",
    "details": "Harris Local Government wanted a refreshed design for their flagship product: MyGovHub - a customer portal for citizens to pay their taxes, utility bills and more. A new landing page concept was developed starting with wireframe sketches which included a splash page with a user login, a create profile form and link to QuickPay allowing users to pay their invoices using their service address and account number, allowing them to submit a payment without creating an account. Working with the Product Manager, multiple 'mobile first' designs were conceived, prototyped and iterated upon until the final design was approved and development started. The final pages were fully responsive, written in AngularJS, HTML and CSS",
    "img1": "http://chuckleone.com/static/media/mgh/mgh-wireframe-home.jpg",
    "img2": "http://chuckleone.com/static/media/mgh/slide-mgh.png",
    "img3": "http://chuckleone.com/static/media/mgh/slide-mgh-usage-prototype.png",
    "imgAlt": "screenshot of My Gov Hub mobile app",
    "link": "https://yorkvilleil.mygovhub.com/#/"
  },
  {
    "id": "citybration",
    "title": "Logo Design",
    "description": "Graphic Design | Adobe Creative Suite",
    "details": "This organization wanted a logo that captured the skyline and essence of the city of Buffalo, NY. Several hand drawn sketches were made and after a couple rounds of changes, the final logo seen below was delivered as an EPS, PNG and AI file.",
    "img1": "http://chuckleone.com/static/media/citybration/citybration-sketches.jpg",
    "img2": "http://chuckleone.com/static/media/citybration/citybration-final.jpg",
    "imgAlt": "Citybration logo"
  },
  {
    "id": "mam",
    "title": "Original line of 3D printed products",
    "description": "Graphic Design | Adobe Creative Suite | Autodesk Fusion 360 | React",
    "details": "As an electronic musician, I needed a product to make using my studio gear such as keyboards, MIDI controllers, drum machines and synthesizers easier to use at desk. I started by learning Fusion 360 and began designing a set of stands that could be easily and cheaply 3D printed, prototyped and tested. I continued to work on my design, iterating and improving on it with each version, testing the set with various devices I had in the studio. Once I had a design that I liked, I posted the results on Reddit and gathered feedback from the community. After a few more rounds of updates, I posted images and pricing on my etsy store and started selling them, gathering feedback from customers on how the product could be improved.",
    "img1": "http://chuckleone.com/static/media/mam/product-col1.jpg",
    "img2": "http://chuckleone.com/static/media/mam/product-col2.jpg",
    "imgAlt": "Monsters + Machines Universal Stands",
    "link": "https://monstersandmachines.com"
  },
  {
    "id": "toshiba",
    "title": "Toshiba App Design",
    "description": "UX Design | Windows | Android | Mobile",
    "details": "As a UX Designer at Synacor, Inc I was tasked with designing a series of user interfaces for a native applications for Toshiba that would ship with all Windows 8 tablets and laptops along with Toshiba Android OS tablets. The applications were NewsPlace, Deals and Offers, Trending Now and Today's Horoscopes. All applications needed to share assets, have a consistent look and feel and meet guidelines established by the Google Play Store, Microsoft App Store and Toshiba's branding guidelines. I worked closely with the Product Manager and the engineering team to develop a series of wireframes, concepts and designs, iterating over each round of changes until these designs were approved. The final deliverables included optomized icon files for each platform, store splash images and all graphical assets and requirements(color values, fonts, etc) for each application.",
    "img1": "http://chuckleone.com/static/media/toshiba/win8-newsplace.jpg",
    "img2": "http://chuckleone.com/static/media/toshiba/android-newsplace.jpg",
    "imgAlt": "Toshiba native app screenshpts"
  }
]
